// Выебоны JS

// ЮЗАЕМ ;

// use strict - строгий режим - режим совместимости

//переменные типизируются динамически

// 8 типов данных 
// number для целых и вещественных чисел,
// bigint для работы с целыми числами произвольной длины,
// string для строк,
// boolean для логических значений истинности или ложности: true/false,
// null – тип с единственным значением null, т.е. «пустое значение» или «значение не существует»,
// undefined – тип с единственным значением undefined, т.е. «значение не задано»,
// object и symbol – сложные структуры данных и уникальные идентификаторы; их мы ещё не изучили.


// Prompt - возвращает введенное значение else null

//Логическое НЕ ! конвертирует операнд в логический тип и возвращает инвертированное значение.

//Операторы сравнения больше/меньше сравнивают строки посимвольно, остальные типы конвертируются в число.

