// данные помещаются в переменнуюс помощью оператора присваивания "="
//процесс присваивания значения переменной - инициализация
// при этом дефелтное значение undefined
let x = 2;
console.log(x); // output "2"

// читабельнее многострочный вариант обьявления переменной

x = 3; // переприсволи значение x, при этом удалив "2"
console.log(x);
// ! переменная может быть обьявлена только один раз
// значения неизвестные до выполнения , но при этом константы -> проприсными буквами

// область видимости - доступность переменной и функции в программе((global scope и function scope))
// let блочная область видимости {}
// var - функциональная
// const - нельзя переназначить новое значение, можно менять свойства обьекта
//проверка
